---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.LiningArea
source: html/d17583f1-6102-56c0-b389-28708dd8c00a.htm
---
# Autodesk.Revit.DB.FabricationPart.LiningArea Property

The lining area of the fabrication part. If the fabrication part is not lined, returns zero.

## Syntax (C#)
```csharp
public double LiningArea { get; }
```